/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cursh.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jterry <jterry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/31 15:18:54 by jterry            #+#    #+#             */
/*   Updated: 2019/08/31 17:17:30 by jterry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

/*
** Функция возвращает 0 если скобка не закрыта
** 1 если все валидно
** -1 если есть не валидные символы
** при -1 необходимо сообщеить об ошибке: "42sh: bad substitution"
*/

int		cursh(char *str)
{
	int i;

	i = 0;
	while (str[i])
	{
		if (str[i] == '{')
			while (str[i] != '}')
			{
				if (str[i] == '\0')
					return (0);
				if (str[i] == '!' || str[i] == '$' || str[i] == '@'
					|| str[i] == '\"' || str[i] == '\\' || str[i] == '\'')
					return (-1);
				i++;
			}
		i++;
	}
	return (1);
}
